## Projecting and Filtering

Let us understand how to project as well as filter data in Data Frames.

In [1]:
%run 06_csv_to_pandas_data_frame.ipynb

In [18]:
orders.head(5)

   order_id             order_date  order_customer_id     order_status
0         1  2013-07-25 00:00:00.0              11599           CLOSED
1         2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2         3  2013-07-25 00:00:00.0              12111         COMPLETE
3         4  2013-07-25 00:00:00.0               8827           CLOSED
4         5  2013-07-25 00:00:00.0              11318         COMPLETE

In [20]:
orders.order_customer_id.unique()

array([11599,   256, 12111,  8827, 11318,  7130,  4530,  2911,  5657,
        5648])

In [21]:
orders.shape

(10, 4)

In [ ]:
order_items

* Projecting data

In [2]:
orders.order_date

0    2013-07-25 00:00:00.0
1    2013-07-25 00:00:00.0
2    2013-07-25 00:00:00.0
3    2013-07-25 00:00:00.0
4    2013-07-25 00:00:00.0
5    2013-07-25 00:00:00.0
6    2013-07-25 00:00:00.0
7    2013-07-25 00:00:00.0
8    2013-07-25 00:00:00.0
9    2013-07-25 00:00:00.0
Name: order_date, dtype: object

In [ ]:
orders['order_date']

In [3]:
# Project order_item_order_id and order_item_subtotal
order_items[['order_item_order_id', 'order_item_subtotal']]

        order_item_order_id  order_item_subtotal
0                         1               299.98
1                         2               199.99
2                         2               250.00
3                         2               129.99
4                         4                49.98
...                     ...                  ...
172193                68881               129.99
172194                68882                59.99
172195                68882                50.00
172196                68883              1999.99
172197                68883               150.00

[172198 rows x 2 columns]

* Filter for order_item_order_id 2

In [4]:
order_items.columns

Index(['order_item_id', 'order_item_order_id', 'order_item_product_id',
       'order_item_quantity', 'order_item_subtotal',
       'order_item_product_price'],
      dtype='object')

In [5]:
order_items.order_item_order_id == 2

0         False
1          True
2          True
3          True
4         False
          ...
172193    False
172194    False
172195    False
172196    False
172197    False
Name: order_item_order_id, Length: 172198, dtype: bool

In [6]:
order_items[order_items.order_item_order_id == 2]

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99

In [ ]:
order_items['order_item_order_id'] == 2

In [ ]:
order_items[order_items['order_item_order_id'] == 2]

In [ ]:
order_items.query('order_item_order_id == 2')

In [7]:
order_items[
    (order_items.order_item_order_id == 2) &
    ((order_items.order_item_subtotal >= 150) &
     (order_items.order_item_subtotal <= 250)
    )]

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00

```{note}
String passed to `query` API is broken into multiple lines for readability purposes.
```

In [8]:
order_items.query('order_item_order_id == 2 and ' +
                  'order_item_subtotal >= 150 and ' +
                  'order_item_subtotal <= 250')

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00

In [ ]:
orders[orders.order_date == '2013-08-01 00:00:00.0']

In [ ]:
orders.query('order_date == "2013-08-01 00:00:00.0"')

```{note}
We can use the functions available as part of `str` usng `python` as engine.
```

In [ ]:
order_date = '2013-08-01 00:00:00.0'

In [ ]:
order_date.startswith?

In [ ]:
order_date.startswith('2013-08')

In [ ]:
orders.query('order_date.str.startswith("2013-08")', engine='python')

### Task 1
Get all the orders placed by customer_id

In [10]:
orders[:10]

   order_id             order_date  order_customer_id     order_status
0         1  2013-07-25 00:00:00.0              11599           CLOSED
1         2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2         3  2013-07-25 00:00:00.0              12111         COMPLETE
3         4  2013-07-25 00:00:00.0               8827           CLOSED
4         5  2013-07-25 00:00:00.0              11318         COMPLETE
5         6  2013-07-25 00:00:00.0               7130         COMPLETE
6         7  2013-07-25 00:00:00.0               4530         COMPLETE
7         8  2013-07-25 00:00:00.0               2911       PROCESSING
8         9  2013-07-25 00:00:00.0               5657  PENDING_PAYMENT
9        10  2013-07-25 00:00:00.0               5648  PENDING_PAYMENT

In [11]:
orders.query('order_customer_id == 12111')

   order_id             order_date  order_customer_id order_status
2         3  2013-07-25 00:00:00.0              12111     COMPLETE

In [14]:
orders[orders.order_customer_id == 12431]

Empty DataFrame
Columns: [order_id, order_date, order_customer_id, order_status]
Index: []

In [16]:
orders[orders['order_customer_id'] == 5657]

   order_id             order_date  order_customer_id     order_status
8         9  2013-07-25 00:00:00.0               5657  PENDING_PAYMENT

### Task 2

Get all the orders placed by customer_id for a given month. Month is passed as **yyyy-MM** format.

In [17]:
orders.query('order_customer_id == 12431 and order_date.str.startswith("2014-01")', engine='python')

Empty DataFrame
Columns: [order_id, order_date, order_customer_id, order_status]
Index: []

In [ ]:
orders[(orders.order_customer_id == 12431) & (orders.order_date.str.startswith('2014-01'))]

### Task 3
Get all the orders which are placed by customer with id 12431 in January 2014 and status is in PENDING_PAYMENT or PROCESSING

In [ ]:
orders.query('order_customer_id == 12431 and ' +
             'order_date.str.startswith("2014-01") and ' +
             'order_status in ("PROCESSING", "PENDING_PAYMENT")', 
             engine='python'
            )

In [ ]:
orders[(orders.order_customer_id == 12431) & 
       (orders.order_date.str.startswith('2014-01')) &
       (orders.order_status.isin(['PROCESSING', 'PENDING_PAYMENT']))
      ]